<?php
if($_POST['number1']=="" && $_POST['number2']!=""){
    echo'لطفا تراز کنکور خود را وارد کنید !';
}
elseif($_POST['number2']=="" && $_POST['number1']!=""){
    echo'لطفا تراز سوابق تحصیلی خود را وارد کنید !';
}
elseif($_POST['number1']=="" && $_POST['number2']==""){
    echo'لطفا تراز کنکور و سوابق تحصیلی خود را وارد کنید!';
}
else{
    $number1=$_POST['number1'];
    $number2=$_POST['number2'];
    $select1=$_POST['select1'];
    $select2=$_POST['select2'];
    $n1=(int) $number1;
    $n2=(int) $number2;
    $r=($n1*0.6)+($n2*0.4);
 if($select2=='t'){
    if($select1=='1'){
        if($r>=9500){
            echo 'حدود رتبه شما 400 به پایین می باشد';
        }
        elseif($r>=9000 && $r<9500){
            echo 'حدود رتبه شما  1100 می باشد';
        }
        elseif($r>=8500 && $r<9000){
            echo 'حدود رتبه شما 2100 می باشد';
        }
        elseif($r>=8000 && $r<8500){
            echo 'حدود رتبه شما 3700 می باشد';
        }
        elseif($r>=7500 && $r<8000){
            echo 'حدود رتبه شما 6100 می باشد';
        }
        elseif($r>=7000 && $r<7500){
            echo 'حدود رتبه شما 9100 می باشد';
        }
        elseif($r>=6500 && $r<7000){
            echo 'حدود رتبه شما 19000 می باشد';
        }
        elseif($r>=6000 && $r<6500){
            echo 'حدود رتبه شما 25000 می باشد';
        }
        elseif($r>=5500 && $r<6000){
            echo 'حدود رتبه شما 30000 می باشد';
        }
        elseif( $r<5500){
            echo 'حدود رتبه شما 33000 به بالا می باشد';
        }
    }
    if($select1=='2'){
        if($r>=9500){
            echo 'حدود رتبه شما 600 به پایین می باشد';
        }
        elseif($r>=9000 && $r<9500){
            echo 'حدود رتبه شما  1500 می باشد';
        }
        elseif($r>=8500 && $r<9000){
            echo 'حدود رتبه شما 3000 می باشد';
        }
        elseif($r>=8000 && $r<8500){
            echo 'حدود رتبه شما 5600 می باشد';
        }
        elseif($r>=7500 && $r<8000){
            echo 'حدود رتبه شما 9400 می باشد';
        }
        elseif($r>=7000 && $r<7500){
            echo 'حدود رتبه شما 14400 می باشد';
        }
        elseif($r>=6500 && $r<7000){
            echo 'حدود رتبه شما 31000 می باشد';
        }
        elseif($r>=6000 && $r<6500){
            echo 'حدود رتبه شما 43000 می باشد';
        }
        elseif($r>=5500 && $r<6000){
            echo 'حدود رتبه شما 50000 می باشد';
        }
        elseif( $r<5500){
            echo 'حدود رتبه شما 60000 به بالا می باشد';
        }
    }
    if($select1=='3'){
        if($r>=9500){
            echo 'حدود رتبه شما 350 به پایین می باشد';
        }
        elseif($r>=9000 && $r<9500){
            echo 'حدود رتبه شما  1000 می باشد';
        }
        elseif($r>=8500 && $r<9000){
            echo 'حدود رتبه شما 2100 می باشد';
        }
        elseif($r>=8000 && $r<8500){
            echo 'حدود رتبه شما 3800 می باشد';
        }
        elseif($r>=7500 && $r<8000){
            echo 'حدود رتبه شما 6700 می باشد';
        }
        elseif($r>=7000 && $r<7500){
            echo 'حدود رتبه شما 10600 می باشد';
        }
        elseif($r>=6500 && $r<7000){
            echo 'حدود رتبه شما26000 می باشد';
        }
        elseif($r>=6000 && $r<6500){
            echo 'حدود رتبه شما 30000 می باشد';
        }
        elseif($r>=5500 && $r<6000){
            echo 'حدود رتبه شما 41000 می باشد';
        }
        elseif( $r<5500){
            echo 'حدود رتبه شما 55000 به بالا می باشد';
        }
    }
  }
  if($select2=='r'){
    if($select1=='1'){
        if($r>=9500){
            echo 'حدود رتبه شما 200 به پایین می باشد';
        }
        elseif($r>=9000 && $r<9500){
            echo 'حدود رتبه شما  1000 می باشد';
        }
        elseif($r>=8500 && $r<9000){
            echo 'حدود رتبه شما 2000 می باشد';
        }
        elseif($r>=8000 && $r<8500){
            echo 'حدود رتبه شما 3000 می باشد';
        }
        elseif($r>=7500 && $r<8000){
            echo 'حدود رتبه شما 5000 می باشد';
        }
        elseif($r>=7000 && $r<7500){
            echo 'حدود رتبه شما 7100 می باشد';
        }
        elseif($r>=6500 && $r<7000){
            echo 'حدود رتبه شما 15000 می باشد';
        }
        elseif($r>=6000 && $r<6500){
            echo 'حدود رتبه شما 20000 می باشد';
        }
        elseif($r>=5500 && $r<6000){
            echo 'حدود رتبه شما 25000 می باشد';
        }
        elseif( $r<5500){
            echo 'حدود رتبه شما 30000 به بالا می باشد';
        }
    }
    if($select1=='2'){
        if($r>=9500){
            echo 'حدود رتبه شما 400 به پایین می باشد';
        }
        elseif($r>=9000 && $r<9500){
            echo 'حدود رتبه شما  1200 می باشد';
        }
        elseif($r>=8500 && $r<9000){
            echo 'حدود رتبه شما 2500 می باشد';
        }
        elseif($r>=8000 && $r<8500){
            echo 'حدود رتبه شما 4000 می باشد';
        }
        elseif($r>=7500 && $r<8000){
            echo 'حدود رتبه شما 7400 می باشد';
        }
        elseif($r>=7000 && $r<7500){
            echo 'حدود رتبه شما 10400 می باشد';
        }
        elseif($r>=6500 && $r<7000){
            echo 'حدود رتبه شما 18000 می باشد';
        }
        elseif($r>=6000 && $r<6500){
            echo 'حدود رتبه شما 23000 می باشد';
        }
        elseif($r>=5500 && $r<6000){
            echo 'حدود رتبه شما 30000 می باشد';
        }
        elseif( $r<5500){
            echo 'حدود رتبه شما 40000 به بالا می باشد';
        }
    }
    if($select1=='3'){
        if($r>=9500){
            echo 'حدود رتبه شما 100 به پایین می باشد';
        }
        elseif($r>=9000 && $r<9500){
            echo 'حدود رتبه شما  800 می باشد';
        }
        elseif($r>=8500 && $r<9000){
            echo 'حدود رتبه شما 1600 می باشد';
        }
        elseif($r>=8000 && $r<8500){
            echo 'حدود رتبه شما 2100 می باشد';
        }
        elseif($r>=7500 && $r<8000){
            echo 'حدود رتبه شما 4700 می باشد';
        }
        elseif($r>=7000 && $r<7500){
            echo 'حدود رتبه شما 6600 می باشد';
        }
        elseif($r>=6500 && $r<7000){
            echo 'حدود رتبه شما10000 می باشد';
        }
        elseif($r>=6000 && $r<6500){
            echo 'حدود رتبه شما 18000 می باشد';
        }
        elseif($r>=5500 && $r<6000){
            echo 'حدود رتبه شما 26000 می باشد';
        }
        elseif( $r<5500){
            echo 'حدود رتبه شما 35000 به بالا می باشد';
        }
    }
  }
  
}
